wujc106/gd32g553r/inc/gd32g5x3_libopt.h
/*!
    \file    gd32g5x3_libopt.h
    \brief   library optional for gd32g5x3

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_LIBOPT_H
#define GD32G5X3_LIBOPT_H

#include "gd32g5x3_adc.h"
#include "gd32g5x3_can.h"
#include "gd32g5x3_cau.h"
#include "gd32g5x3_cmp.h"
#include "gd32g5x3_cpdm.h"
#include "gd32g5x3_crc.h"
#include "gd32g5x3_dac.h"
#include "gd32g5x3_dbg.h"
#include "gd32g5x3_dma.h"
#include "gd32g5x3_exmc.h"
#include "gd32g5x3_exti.h"
#include "gd32g5x3_fmc.h"
#include "gd32g5x3_fmc_ramfunc.h"
#include "gd32g5x3_fwdgt.h"
#include "gd32g5x3_gpio.h"
#include "gd32g5x3_hrtimer.h"
#include "gd32g5x3_i2c.h"
#include "gd32g5x3_misc.h"
#include "gd32g5x3_pmu.h"
#include "gd32g5x3_rcu.h"
#include "gd32g5x3_rtc.h"
#include "gd32g5x3_spi.h"
#include "gd32g5x3_syscfg.h"
#include "gd32g5x3_timer.h"
#include "gd32g5x3_tmu.h"
#include "gd32g5x3_trigsel.h"
#include "gd32g5x3_trng.h"
#include "gd32g5x3_usart.h"
#include "gd32g5x3_vref.h"
#include "gd32g5x3_wwdgt.h"
#if (defined(GD32G553))
#include "gd32g5x3_qspi.h"
#include "gd32g5x3_cla.h"
#include "gd32g5x3_fac.h"
#include "gd32g5x3_fft.h"
#include "gd32g5x3_hpdf.h"
#include "gd32g5x3_lptimer.h"
#endif /* (defined(GD32G553)) */

#endif /* GD32G5X3_LIBOPT_H */
